Revit 2027 API
EnergyAnalysisOpening.OriginatingElementId Property
 The element id for the originating Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId OriginatingElementId { get; }
Public ReadOnly Property OriginatingElementId As LinkElementId
	Get
public:
property LinkElementId^ OriginatingElementId {
	LinkElementId^ get ();
}
member OriginatingElementId : LinkElementId with get
Property Value
LinkElementId
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace